Revit 2027 API
PointCloudOverrides.SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings) Method
 Assigns region override settings to the whole PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPointCloudRegionOverrideSettings(
	ElementId elementId,
	PointCloudOverrideSettings newSettings
)
Public Sub SetPointCloudRegionOverrideSettings (
	elementId As ElementId,
	newSettings As PointCloudOverrideSettings
)
public:
void SetPointCloudRegionOverrideSettings(
	ElementId^ elementId,
	PointCloudOverrideSettings^ newSettings
)
member SetPointCloudRegionOverrideSettings :
        elementId : ElementId *
        newSettings : PointCloudOverrideSettings -> unit
Parameters
elementId ElementId
 Id of the element to be overridden.
newSettings PointCloudOverrideSettings
 Override settings to be assigned.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
SetPointCloudRegionOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace